Revit 2026 API

# AnalyticalMemberSectionTypeId Property

---

The id of the type from the structural Family assigned to the Analytical Member.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId SectionTypeId { get; set; }
```
```vb
Public Property SectionTypeId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ SectionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member SectionTypeId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: sectionTypeId is the id of some element that is not a FamilySymbol or is not of the category "Structural Framing" (OST_StructuralFraming) or "Structural Columns" (OST_StructuralColumns) |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The type must be of category "Structural Framing" (OST_StructuralFraming) or "Structural Columns" (OST_StructuralColumns)

#### Reference

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace